----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
   ReflectionPad2d-1          [-1, 3, 262, 262]               0
            Conv2d-2         [-1, 64, 256, 256]           9,472
            Conv2d-3         [-1, 64, 256, 256]               0
    InstanceNorm2d-4         [-1, 64, 256, 256]               0
              ReLU-5         [-1, 64, 256, 256]               0
            Conv2d-6        [-1, 128, 128, 128]           8,320
            Conv2d-7        [-1, 128, 128, 128]               0
    InstanceNorm2d-8         [-1, 64, 256, 256]               0
              ReLU-9         [-1, 64, 256, 256]               0
           Conv2d-10         [-1, 32, 256, 256]           2,080
   InstanceNorm2d-11         [-1, 32, 256, 256]               0
             ReLU-12         [-1, 32, 256, 256]               0
  ReflectionPad2d-13         [-1, 32, 258, 258]               0
           Conv2d-14         [-1, 32, 128, 128]           9,248
           Conv2d-15         [-1, 32, 128, 128]               0
   InstanceNorm2d-16         [-1, 32, 128, 128]               0
             ReLU-17         [-1, 32, 128, 128]               0
           Conv2d-18        [-1, 128, 128, 128]           4,224
       Bottleneck-19        [-1, 128, 128, 128]               0
           Conv2d-20          [-1, 256, 64, 64]          33,024
           Conv2d-21          [-1, 256, 64, 64]               0
   InstanceNorm2d-22        [-1, 128, 128, 128]               0
             ReLU-23        [-1, 128, 128, 128]               0
           Conv2d-24         [-1, 64, 128, 128]           8,256
   InstanceNorm2d-25         [-1, 64, 128, 128]               0
             ReLU-26         [-1, 64, 128, 128]               0
  ReflectionPad2d-27         [-1, 64, 130, 130]               0
           Conv2d-28           [-1, 64, 64, 64]          36,928
           Conv2d-29           [-1, 64, 64, 64]               0
   InstanceNorm2d-30           [-1, 64, 64, 64]               0
             ReLU-31           [-1, 64, 64, 64]               0
           Conv2d-32          [-1, 256, 64, 64]          16,640
       Bottleneck-33          [-1, 256, 64, 64]               0
      Inspiration-34          [-1, 256, 64, 64]          65,536
   InstanceNorm2d-35          [-1, 256, 64, 64]               0
             ReLU-36          [-1, 256, 64, 64]               0
           Conv2d-37           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-38           [-1, 64, 64, 64]               0
             ReLU-39           [-1, 64, 64, 64]               0
  ReflectionPad2d-40           [-1, 64, 66, 66]               0
           Conv2d-41           [-1, 64, 64, 64]          36,928
           Conv2d-42           [-1, 64, 64, 64]               0
   InstanceNorm2d-43           [-1, 64, 64, 64]               0
             ReLU-44           [-1, 64, 64, 64]               0
           Conv2d-45          [-1, 256, 64, 64]          16,640
       Bottleneck-46          [-1, 256, 64, 64]               0
   InstanceNorm2d-47          [-1, 256, 64, 64]               0
             ReLU-48          [-1, 256, 64, 64]               0
           Conv2d-49           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-50           [-1, 64, 64, 64]               0
             ReLU-51           [-1, 64, 64, 64]               0
  ReflectionPad2d-52           [-1, 64, 66, 66]               0
           Conv2d-53           [-1, 64, 64, 64]          36,928
           Conv2d-54           [-1, 64, 64, 64]               0
   InstanceNorm2d-55           [-1, 64, 64, 64]               0
             ReLU-56           [-1, 64, 64, 64]               0
           Conv2d-57          [-1, 256, 64, 64]          16,640
       Bottleneck-58          [-1, 256, 64, 64]               0
   InstanceNorm2d-59          [-1, 256, 64, 64]               0
             ReLU-60          [-1, 256, 64, 64]               0
           Conv2d-61           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-62           [-1, 64, 64, 64]               0
             ReLU-63           [-1, 64, 64, 64]               0
  ReflectionPad2d-64           [-1, 64, 66, 66]               0
           Conv2d-65           [-1, 64, 64, 64]          36,928
           Conv2d-66           [-1, 64, 64, 64]               0
   InstanceNorm2d-67           [-1, 64, 64, 64]               0
             ReLU-68           [-1, 64, 64, 64]               0
           Conv2d-69          [-1, 256, 64, 64]          16,640
       Bottleneck-70          [-1, 256, 64, 64]               0
   InstanceNorm2d-71          [-1, 256, 64, 64]               0
             ReLU-72          [-1, 256, 64, 64]               0
           Conv2d-73           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-74           [-1, 64, 64, 64]               0
             ReLU-75           [-1, 64, 64, 64]               0
  ReflectionPad2d-76           [-1, 64, 66, 66]               0
           Conv2d-77           [-1, 64, 64, 64]          36,928
           Conv2d-78           [-1, 64, 64, 64]               0
   InstanceNorm2d-79           [-1, 64, 64, 64]               0
             ReLU-80           [-1, 64, 64, 64]               0
           Conv2d-81          [-1, 256, 64, 64]          16,640
       Bottleneck-82          [-1, 256, 64, 64]               0
   InstanceNorm2d-83          [-1, 256, 64, 64]               0
             ReLU-84          [-1, 256, 64, 64]               0
           Conv2d-85           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-86           [-1, 64, 64, 64]               0
             ReLU-87           [-1, 64, 64, 64]               0
  ReflectionPad2d-88           [-1, 64, 66, 66]               0
           Conv2d-89           [-1, 64, 64, 64]          36,928
           Conv2d-90           [-1, 64, 64, 64]               0
   InstanceNorm2d-91           [-1, 64, 64, 64]               0
             ReLU-92           [-1, 64, 64, 64]               0
           Conv2d-93          [-1, 256, 64, 64]          16,640
       Bottleneck-94          [-1, 256, 64, 64]               0
   InstanceNorm2d-95          [-1, 256, 64, 64]               0
             ReLU-96          [-1, 256, 64, 64]               0
           Conv2d-97           [-1, 64, 64, 64]          16,448
   InstanceNorm2d-98           [-1, 64, 64, 64]               0
             ReLU-99           [-1, 64, 64, 64]               0
 ReflectionPad2d-100           [-1, 64, 66, 66]               0
          Conv2d-101           [-1, 64, 64, 64]          36,928
          Conv2d-102           [-1, 64, 64, 64]               0
  InstanceNorm2d-103           [-1, 64, 64, 64]               0
            ReLU-104           [-1, 64, 64, 64]               0
          Conv2d-105          [-1, 256, 64, 64]          16,640
      Bottleneck-106          [-1, 256, 64, 64]               0
        Upsample-107        [-1, 256, 128, 128]               0
          Conv2d-108        [-1, 128, 128, 128]          32,896
          Conv2d-109        [-1, 128, 128, 128]               0
  InstanceNorm2d-110          [-1, 256, 64, 64]               0
            ReLU-111          [-1, 256, 64, 64]               0
          Conv2d-112           [-1, 32, 64, 64]           8,224
  InstanceNorm2d-113           [-1, 32, 64, 64]               0
            ReLU-114           [-1, 32, 64, 64]               0
        Upsample-115         [-1, 32, 128, 128]               0
 ReflectionPad2d-116         [-1, 32, 130, 130]               0
          Conv2d-117         [-1, 32, 128, 128]           9,248
          Conv2d-118         [-1, 32, 128, 128]               0
  InstanceNorm2d-119         [-1, 32, 128, 128]               0
            ReLU-120         [-1, 32, 128, 128]               0
          Conv2d-121        [-1, 128, 128, 128]           4,224
      Bottleneck-122        [-1, 128, 128, 128]               0
        Upsample-123        [-1, 128, 256, 256]               0
          Conv2d-124         [-1, 64, 256, 256]           8,256
          Conv2d-125         [-1, 64, 256, 256]               0
  InstanceNorm2d-126        [-1, 128, 128, 128]               0
            ReLU-127        [-1, 128, 128, 128]               0
          Conv2d-128         [-1, 16, 128, 128]           2,064
  InstanceNorm2d-129         [-1, 16, 128, 128]               0
            ReLU-130         [-1, 16, 128, 128]               0
        Upsample-131         [-1, 16, 256, 256]               0
 ReflectionPad2d-132         [-1, 16, 258, 258]               0
          Conv2d-133         [-1, 16, 256, 256]           2,320
          Conv2d-134         [-1, 16, 256, 256]               0
  InstanceNorm2d-135         [-1, 16, 256, 256]               0
            ReLU-136         [-1, 16, 256, 256]               0
          Conv2d-137         [-1, 64, 256, 256]           1,088
      Bottleneck-138         [-1, 64, 256, 256]               0
  InstanceNorm2d-139         [-1, 64, 256, 256]               0
            ReLU-140         [-1, 64, 256, 256]               0
 ReflectionPad2d-141         [-1, 64, 262, 262]               0
          Conv2d-142          [-1, 3, 256, 256]           9,411
          Conv2d-143          [-1, 3, 256, 256]               0
================================================================
Total params: 691,555
Trainable params: 691,555
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 1256.60
Params size (MB): 2.64
Estimated Total Size (MB): 1259.99
----------------------------------------------------------------